{
    "product_title": "Shark Anti Hair Wrap & Flexology Cordless Vacuum Cleaner",
    "page_title": "Shark Anti Hair Wrap & Flexology Cordless Vacuum Cleaner",
    "images": [],
    "brand_color": "#be6d45",
    "logo_url": "https://cheapfurniturewarehouse.co.uk/cdn/shop/files/1_9c3d228e-0210-4146-87c7-547a89a6ce5b.png?v=1727802997",
    "shop_url": "https://www.ebay.co.uk/str/cfurniturewarehousebradford",
    "condition": {
        "title": "Item Condition: New Other (Open Box)",
        "details": [
            "<strong>Condition Details:</strong> Packaging may have cosmetic damage (e.g., scuffs, tears) or be non-original.",
            "<strong>Item Status:</strong> The product itself is brand new, unused, and in pristine condition.",
            "<strong>Quality Check:</strong> Professionally inspected and verified by our warehouse team.",
            "<strong>Contents:</strong> 100% fully functional with all original fittings and fixtures included.",
            "<strong>Warranty:</strong> Includes a full 12-Month Warranty for your peace of mind."
        ]
    },
    "description": {
        "main_text": "<div class=\"product-description-content-text\" itemprop=\"description\"><p>Tired of removing tangled hair from your vacuum cleaner's brush-roll? Shark's signature Anti Hair Wrap Technology separates and removes hair from the motorised brush-roll as you clean, sucking it straight up into the dust cup. Perfect for long, short and pet hair. Enjoy up to 40 minutes of run-time then charge Shark's removable battery pack on or off the vacuum, wherever suits you. A battery light indicator lets you know how much charge is remaining. (In ION power mode, with non-motorised tool).  </p><p>Flexology bends so you don't have to. At the touch of a button, the flexible wand bends to easily clean underneath low-lying furniture. When you've finished, fold down for compact, freestanding storage and charging. </p><p>Easily switch between carpet and hard floor modes using convenient handle controls. Pull the Boost trigger for extra power. Bright LED headlights in the floorhead help to illuminate hidden dust under furniture. </p><p>Transform into a handheld vacuum at the touch of a button – perfect for cleaning stairs, soft furnishings, in the car and more. Clean anywhere with the included Crevice Tool and Upholstery Tool, which can be stored in the handy accessory bag. </p><p>Anti-Allergen Complete Seal captures and traps 99.9% of dust and allergens inside the vacuum, not releasing them back into the air you breathe. (Based on IEC standard 62885-2 Cl. 5.11 at 0.3 to 10 microns). </p><p>Floor suitability:</p><ul><li>Suitable for carpets and rugs. </li><li>Suitable for deep pile carpet and rugs. </li><li>Suitable for hard floors. </li><li>Suitable for laminate flooring. </li><li>Suitable for upholstery. </li><li>Suitable for stairs. </li></ul><p>Vacuum cleaner features:</p><ul><li>Weight 3.75kg. </li><li>Size H119, W27, D17cm. </li><li>Charge time: 3.5 hours to fully charge. </li><li>40 mins, depending on the setting used. </li><li>Low battery indicator. </li><li>Number of batteries in pack: 1. </li><li>Detachable handheld included. </li><li>Power boost - clean with increased power. </li><li>HEPA filter - traps small particles and pet dander, making it excellent for allergy sufferers. </li><li>Washable filter - wash regularly to maintain suction. </li><li>Motorised floor head - drives bristles in to carpet to remove ground in dirt. </li><li>Adjustable floorhead - switch between carpet and hard floor at the touch of a button. </li><li>Includes crevice nozzle, upholstery nozzle, . </li><li>Dust capacity 0.7 litre. </li><li>Dustbag full indicator. </li><li>25.2 volts. </li><li>Noise level: 86dB. </li></ul><p>General information:</p><ul><li>Model number: IZ202UK. </li><li>Manufacturer's 5 year (2 year on batteries) guarantee. </li><li>EAN: 0622356262996. </li></ul></div>"
    },
    "delivery": {
        "items": [
            {
                "label": "Despatch:",
                "value": "Orders placed Mon-Fri before 9 AM are typically dispatched same day. Weekend orders dispatched next working day."
            },
            {
                "label": "Standard Delivery:",
                "value": "48-Hour Tracked Service (Free for items under 25kg)."
            },
            {
                "label": "Bulk Items:",
                "value": "Shipped within 3 working days, delivered within 5."
            },
            {
                "label": "",
                "value": "We deliver within the UK only. Please check our shipping policy for exclusion zones."
            }
        ]
    },
    "returns": {
        "title": "14-Day Hassle-Free Returns",
        "details": [
            "<strong>Returns Period:</strong> 14 Days from purchase.",
            "<strong>Condition:</strong> Items must be returned in original packaging.",
            "<strong>Faulty Items:</strong> If your item arrives damaged or faulty, please contact us immediately for a replacement or refund."
        ]
    }
}